{
  "books": [
    {
      "id": 1,
      "name": "Harry Potter i Kamień Filozoficzny",
      "desc": "Harry Potter, sierota i podrzutek, od niemowlęcia wychowywany był przez ciotkę i wuja, którzy traktowali go jak piąte koło u wozu. Pochodzenie chłopca owiane jest tajemnicą; jedyną pamiątką Harry`ego z przeszłości jest zagadkowa blizna na czole. Skąd jednak biorą się niesamowite zjawiska, które towarzyszą nieświadomemu niczego Potterowi? Wszystko zmienia się w dniu jedenastych urodzin chłopca.",
      "author": "J.K. Rowling",
      "imageLink": "https://s.lubimyczytac.pl/upload/books/308000/308630/494238-352x500.jpg",
      "isFavorite": true,
      "isRead": true
    },
    {
      "id": 2,
      "name": "Drużyna Pierścienia",
      "desc": "W zamierzchłych czasach kowale elfów wykuli Pierścienie Mocy. Lecz Mroczny Władca, stworzył w tajemnicy Jedyny Pierścień, napełniając go swą potęgą, aby rządził pozostałymi. Ale Pierścień zniknął i przepadł gdzieś w Śródziemiu.Minęło wiele wieków, zanim się odnalazł i trafi ł w ręce hobbita, którego przeznaczeniem stała się wędrówka do Krainy Cienia, by zniszczyć Jedyny Pierścień...",
      "author": "J.R.R. Tolkien",
      "imageLink": "https://s.lubimyczytac.pl/upload/books/159000/159957/352x500.jpg",
      "isFavorite": false,
      "isRead": true
    },
    {
      "id": 3,
      "name": "Diablo. Wojna Grzechu #1: Prawo krwi",
      "desc": "Od zarania dziejów anielskie zastępy Królestwa Niebios oraz demoniczne hordy Płonących Piekieł pogrążone były w wiecznym konflikcie o los całego Stworzenia. Teraz ta wojna objęła także Sanktuarium – świat ludzi. Każda ze stron pragnie zdobyć ludzkość dla własnych celów. Siły dobra i zła toczą sekretną wojnę o dusze śmiertelników. Oto opowieść o Wojnie Grzechu – konflikcie, który już na zawsze zmieni przeznaczenie człowieka.",
      "author": "Richard A. Knaak",
      "imageLink": "https://s.lubimyczytac.pl/upload/books/234000/234646/408720-352x500.jpg",
      "isFavorite": true,
      "isRead": false
    },
    {
      "id": 4,
      "name": "Diablo. Wojna Grzechu #1: Prawo krwi",
      "desc": "ddddddddddfff",
      "author": "Richard A. Knaak",
      "imageLink": "https://s.lubimyczytac.pl/upload/books/234000/234646/408720-352x500.jpg",
      "isFavorite": true,
      "isRead": true
    }
  ]
}